liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/inc/Can_17_McmCan.h
/*******************************************************************************
**                                                                            **
**  Copyright (C) Infineon Technologies (2017)                                **
**                                                                            **
**  All rights reserved.                                                      **
**                                                                            **
**  This document contains proprietary information belonging to Infineon      **
**  Technologies. Passing on and copying of this document, and communication  **
**  of its contents is not permitted without prior written authorization.     **
**                                                                            **
********************************************************************************
**                                                                            **
**  FILENAME     : Can_17_McmCan.h                                            **
**                                                                            **
**  VERSION      : 4.0.0                                                      **
**                                                                            **
**  DATE         : 2018-08-08                                                 **
**                                                                            **
**  VARIANT      : Variant PB                                                 **
**                                                                            **
**  PLATFORM     : Infineon AURIX2G                                           **
**                                                                            **
**  AUTHOR       : DL-AUTOSAR-Engineering                                     **
**                                                                            **
**  VENDOR       : Infineon Technologies                                      **
**                                                                            **
**  TRACEABILITY : [cover parentID={BF45E37B-05DF-4a01-8B07-8FDEBA3DEE6E}]    **
**                 [cover parentID={DA6A0DC6-8157-42d9-8ABB-5D18C6B692F5}]    **
**                                                                            **
**  DESCRIPTION  : CAN Driver header definition file                          **
**                                                                            **
**  SPECIFICATION(S) : Specification of CAN Driver, AUTOSAR Release 4.2.2     **
**                                                                            **
**  MAY BE CHANGED BY USER : no                                               **
**                                                                            **
*******************************************************************************/

#ifndef CAN_17_MCMCAN_H
#define CAN_17_MCMCAN_H

/*******************************************************************************
**                      Include Section                                       **
*******************************************************************************/

/* [cover parentID={6CE56ADD-37B9-4c96-BC08-609A206511DC}]
[/cover] */
/* [cover parentID={C0E673D5-B80C-40f5-9944-70221E106146}]
[/cover] */
/* Register definition file for Aurix2G target */
#include "IfxCan_reg.h"
/* Include Communication Stack Types */
#include "ComStack_Types.h"
/* Include the declarations of Can functions and types */
#include "Can_17_McmCan_Cfg.h"
/* [cover parentID={594CC1E2-D5F5-40fc-9916-76425DAA99DF}]
[/cover] */
/* Includes all types and constants that are shared among the
   AUTOSAR CAN modules Can, CanIf and CanTrcv */
#include "Can_GeneralTypes.h"
/* Inclusion of Mcal Specific Global Header File */
#include "McalLib.h"
#include "Mcal_Compiler.h"

/*******************************************************************************
**                      Global Macro Definitions                              **
*******************************************************************************/

/* Published parameters */

/* CAN Vendor ID - Vendor ID of the dedicated implementation of this
module according to the AUTOSAR vendor list */
#define CAN_17_MCMCAN_VENDOR_ID                  ((uint16)17)
/* CAN Module ID - Module ID of this module from Module List */
#define CAN_17_MCMCAN_MODULE_ID                  ((uint16)80)

#if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON)
/* [cover parentID={06D1B973-8E2A-4923-970C-686093ABAFD2}]
[/cover] */
/* API Service called with wrong parameter: Config is a null pointer */
#define CAN_17_MCMCAN_E_PARAM_POINTER                      ((uint8)0x01)
/* [cover parentID={0BF785B4-8E12-43f7-8AF5-BCA49BFB8D87}]
[/cover] */
/* API called with wrong parameter: Handle parameter is not a
configured Hardware Transmit Handle */
#define CAN_17_MCMCAN_E_PARAM_HANDLE                       ((uint8)0x02)
/* [cover parentID={9ED8C975-CA94-41e9-9613-025FCBF17E96}]
[/cover] */
/* API called with wrong parameter : Parameter Data length is
more than 8 bytes */
#define CAN_17_MCMCAN_E_PARAM_DLC                          ((uint8)0x03)
/* [cover parentID={B81C2953-A515-4a48-9267-57D40F5FD116}]
[/cover] */
/* API called with wrong parameter : Parameter Controller is out of range */
#define CAN_17_MCMCAN_E_PARAM_CONTROLLER                   ((uint8)0x04)
/* [cover parentID={05598611-0879-4065-A5B4-4ED73DD973CE}]
[/cover] */
/* API Service used without initialization */
#define CAN_17_MCMCAN_E_UNINIT                             ((uint8)0x05)
/* [cover parentID={8D8DB9BD-EF6D-4906-BEF9-2043468C9472}]
[/cover] */
/* Invalid invalid transition requested OR Invalid CAN controller state for
API service call */
#define CAN_17_MCMCAN_E_TRANSITION                         ((uint8)0x06)
/* [cover parentID={4D86462A-BB81-4c29-B566-F1C306C59D08}]
[/cover] */
/* DET for Over write error in receive ISR */
#define CAN_17_MCMCAN_E_DATALOST                           ((uint8)0x07)
/* [cover parentID={68BF99F9-E0BD-4b2e-A430-ADE85607E95E}]
[/cover] */
/* API called with invalid / unsupported baudrate */
#define CAN_17_MCMCAN_E_PARAM_BAUDRATE                     ((uint8)0x08)
/* [cover parentID={AE8B3176-0F3B-4c32-9EF7-39AF041D75F5}]
[/cover] */
/* Invalid ICOM configuration Id */
#define CAN_17_MCMCAN_E_ICOM_CONFIG_INVALID                ((uint8)0x09)
/* [cover parentID={76F0A24E-BD8A-43f1-869F-3AD067317A48}]
[/cover] */
/* Invalid configuration set selection */
#define CAN_17_MCMCAN_E_INIT_FAILED                        ((uint8)0x0A)
/* [cover parentID={4B121357-CD4D-483b-B5D0-2655DF362A49}]
[/cover] */
/* API called with invalid value of Can Message Id */
#define CAN_17_MCMCAN_E_PARAM_MSGID                        ((uint8)0x0D)

#if(CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON)
/* Resource not configured to calling core */
#define CAN_17_MCMCAN_E_NOT_CONFIGURED                     ((uint8)0x64)
/* Core Initialization called when master initialization is not done */
#define CAN_17_MCMCAN_E_MASTER_CORE_UNINIT                 ((uint8)0x66)
/* [cover parentID={A28907C5-5A4A-4971-8442-1B9D7FE405D5}]
[/cover] */
/* Master De-initialization called before de-initialization of the slave cores*/
#define CAN_17_MCMCAN_E_SLAVE_CORE_INIT                    ((uint8)0x67)
#endif /* #if(CAN_17_MCMCAN_MULTICORE_ERROR_DETECT == STD_ON) */

#endif /* #if(CAN_17_MCMCAN_DEV_ERROR_DETECT == STD_ON) */

/* Service IDs. Used while reporting development errors */
#define CAN_17_MCMCAN_SID_INIT                             ((uint8)0x00)
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_SID_MAINFUNCTIONWRITE                ((uint8)0x01)
#define CAN_17_MCMCAN_SID_SETCONTROLLERMODE                ((uint8)0x03)
#define CAN_17_MCMCAN_SID_DISABLECONTROLLERINTERRUPTS      ((uint8)0x04)
#define CAN_17_MCMCAN_SID_ENABLECONTROLLERINTERRUPTS       ((uint8)0x05)
#define CAN_17_MCMCAN_SID_WRITE                            ((uint8)0x06)
#define CAN_17_MCMCAN_SID_GETVERSIONINFO                   ((uint8)0x07)
#define CAN_17_MCMCAN_SID_MAINFUNCTIONREAD                 ((uint8)0x08)
#define CAN_17_MCMCAN_SID_MAINFUNCTIONBUSOFF               ((uint8)0x09)
/* MISRA2012_RULE_5_1_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_2_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_4_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
/* MISRA2012_RULE_5_5_JUSTIFICATION: External identifiers going beyond 32 chars.
in generated code due to Autosar Naming constraints.*/
#define CAN_17_MCMCAN_SID_MAINFUNCTIONWAKEUP               ((uint8)0x0a)
#define CAN_17_MCMCAN_SID_CHECKBAUDRATE                    ((uint8)0x0e)
#define CAN_17_MCMCAN_SID_DEINIT                           ((uint8)0x65)
#define CAN_17_MCMCAN_SID_SETBAUDRATE                      ((uint8)0x0f)
#define CAN_17_MCMCAN_SID_SETICOMCONFIGURATION             ((uint8)0x10)
#define CAN_17_MCMCAN_SID_RECEIVEHANDLER                   ((uint8)0x12)

/* Diver used values */
#define CAN_17_MCMCAN_POLLING                               (uint8)0
#define CAN_17_MCMCAN_INTERRUPT                             (uint8)1

/* Identifier types of an L-PDU */
#define CAN_17_MCMCAN_ID_STANDARD                           (0x00)
#define CAN_17_MCMCAN_ID_MIXED                              (0x01)
#define CAN_17_MCMCAN_ID_EXTENDED                           (0x02)

