liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/inc/Can_17_McmCan.h
/* Macros related to User mode implementation */
#define CAN_17_MCMCAN_MCAL_SUPERVISOR                 (0U)
#define CAN_17_MCMCAN_MCAL_USER1                      (1U)

/* Macros related to Kernels and Nodes for respective controller ID */

/* KERNEL0 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMKERNEL0_ID                             (0U)

/* KERNEL0 CONTROLLER 0 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER00_ID                        (0U)

/* KERNEL0 CONTROLLER 1 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER01_ID                        (1U)

/* KERNEL0 CONTROLLER 2 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER02_ID                        (2U)

/* KERNEL0 CONTROLLER 3 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER03_ID                        (3U)


/* KERNEL1 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMKERNEL1_ID                             (1U)

/* KERNEL1 CONTROLLER 0 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER10_ID                        (0U)

/* KERNEL1 CONTROLLER 1 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER11_ID                        (1U)

/* KERNEL1 CONTROLLER 2 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER12_ID                        (2U)

/* KERNEL1 CONTROLLER 3 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER13_ID                        (3U)


/* KERNEL2 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMKERNEL2_ID                             (2U)

/* KERNEL2 CONTROLLER 0 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER20_ID                        (0U)

/* KERNEL2 CONTROLLER 1 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER21_ID                        (1U)

/* KERNEL2 CONTROLLER 2 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER22_ID                        (2U)

/* KERNEL2 CONTROLLER 3 Configuration ID*/
#define CAN_17_MCMCAN_HWMCMCONTROLLER23_ID                        (3U)

/* Number of nodes per kernel */
#define CAN_17_MCMCAN_NOOF_NODES_PER_KERNEL                       (4U)

/* Number of RAM sections required for CAN messages configured */
#define CAN_17_MCMCAN_NOOF_RAM_SECTIONS_PER_CONTROLLER            (7U)

/* Number of memory Map details required */
#define CAN_17_MCMCAN_NOOF_MOMAP_PER_CONTROLLER                   (6U)

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* Size in bytes of the ICOM Signal */
#define CAN_17_MCMCAN_ICOM_DATA_SIGNAL_MATCH_SIZE                   (8U)
#endif
/*******************************************************************************
**                      Global Type Definitions                               **
*******************************************************************************/

/* Data type used for Tx buffer Type */
typedef enum
{
  CAN_17_MCMCAN_TX_DED_BUFFER = 0,
  CAN_17_MCMCAN_TX_QUEUE = 1
} Can_17_McmCan_TxBufferType;

/* Data type used for Rx buffer Type */
typedef enum
{
  CAN_17_MCMCAN_RX_DED_BUFFER = 0,
  CAN_17_MCMCAN_RX_FIFO0 = 1,
  CAN_17_MCMCAN_RX_FIFO1 = 2
} Can_17_McmCan_RxBufferType;

#if(CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* Data type used for Icom signal operator */
typedef enum
{
  CAN_17_MCMCAN_ICOM_OPER_AND,
  CAN_17_MCMCAN_ICOM_OPER_EQUAL,
  CAN_17_MCMCAN_ICOM_OPER_GREATER,
  CAN_17_MCMCAN_ICOM_OPER_SMALLER,
  CAN_17_MCMCAN_ICOM_OPER_XOR
} Can_17_McmCan_IcomSignalOperType;
#endif

/* CAN Kernel Configuration data type */
typedef struct
{
  /* The Global Base address of Kernel module */
  Ifx_CAN* CanBaseAddress;
  /* The information of used controller configuration */
  boolean CanUsedHwCfgIndx [CAN_17_MCMCAN_NOOF_NODES_PER_KERNEL];
} Can_17_McmCan_McmModuleConfigType;

/* CAN Controller corresponding Message RAM Partition Configuration data type */
typedef struct
{
  /* Start Address of Each Section with in the Message RAM */
  uint32 CanControllerMsgRAMMap [CAN_17_MCMCAN_NOOF_RAM_SECTIONS_PER_CONTROLLER];
  /* No of used Tx dedicated buffer */
  uint8 CanTxDedBuffCount;
  /* TxEvent FIFO Size */
  uint8 CanTxEvntFIFOSize;
  /* RXFIFO0 Size */
  uint8 CanRxFIFO0Size;
  /* RXFIFO0 Water Mark Level */
  uint8 CanRxFIFO0Threshold;
  /* RXFIFO1 Size */
  uint8 CanRxFIFO1Size;
  /* RXFIFO1 Water Mark Level */
  uint8 CanRxFIFO1Threshold;

  #if(CAN_17_MCMCAN_MULTIPLEXED_TRANSMISSION == STD_ON)
  /* Tx Queue buffer Size */
  uint8 CanTxQueueSize;
  /* Tx Configuration support status */
  boolean CanTxQueueStatus;
  #endif
} Can_17_McmCan_ControllerMsgRAMConfigType;

/* CAN Controller Baudrate Configuration data type */
typedef struct
{
  /* Nominal Baudrate settings value */
  uint32 CanControllerBaudrate;
  /* Baudrate value configured in Kbps */
  uint16 CanBaudrateCfg;
  #if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* Supporting FD Baudrate configuration index value */
  uint16 CanFDIndex;
  /* Status of FD configuration support */
  boolean CanFdConfigEnabled;
  #endif
} Can_17_McmCan_ControllerBaudrateConfigType;

#if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
/* CAN Controller FDBaudrate Configuration data type */
typedef struct
{
  /* FD Baudrate settings value */
  uint32 CanControllerFDBaudrate;
  /* Transceiver Delay composition Register set value */
  uint32  CanTrcvDelyComp;
  /* BSR status value */
  boolean CanTxBRSEnable;
} Can_17_McmCan_ControllerFDBaudrateConfigType;
#endif

/* Data type for CAN Receive Hardware object configuration - Standard
Message filter. */
typedef struct
{
  /* Standard Filter mask value */
  uint32 CanSIDFiltEleS0;
  /* Hardware object Id */
  Can_HwHandleType CanSidHwObjId;
  /* configuration id of Controller to which this hardware object is assigned */
  uint8 HwControllerId;
  /* The filter settings for which type of Rx Buffer */
  Can_17_McmCan_RxBufferType CanSidBufferType;

  #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  /* The Normal message ID is supported for ICOM support or not */
  boolean CanSidPNSupport;
  #endif

} Can_17_McmCan_SIDFilterConfigType;

/* Data type for CAN Receive Hardware object configuration - Extended
Message filter. */
typedef struct
{
  /* Extended Filter mask value0 */
  uint32 CanXIDFiltEleF0;
  /* Extended Filter mask value1 */
  uint32 CanXIDFiltEleF1;
  /* Hardware object Id */
  Can_HwHandleType CanXidHwObjId;
  /* configuration id of Controller to which this hardware object is assigned */
  uint8  HwControllerId;
  /* The filter settings for which type of Rx Buffer */
  Can_17_McmCan_RxBufferType CanXidBufferType;

