liuxu324/SIP_CBD1900078_D01_Tricore/CBD1900078_D01_Tricore/ThirdParty/Mcal_Tc3xx/Supply/MC-ISAR_AS42x_AURIX2G_TC38xA_TC39xB_BASIC_1.0.0-rc/McIsar/Src/Mcal/Tricore/Can_17_McmCan/ssc/inc/Can_17_McmCan.h
  #if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
  /* The Normal message ID is supported for ICOM support or not */
  boolean CanXidPNSupport;
  #endif

} Can_17_McmCan_XIDFilterConfigType;

/* Data type for CAN Transmit Hardware object configuration */
typedef struct
{
  /* Hardware object Id */
  Can_HwHandleType CanTxHwObjId;
  /* Tx Buffer index number */
  uint8 CanTxBuffIndx;
  /* configuration id of Controller to which this hardware object is assigned */
  uint8 HwControllerId;

  #if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* The CAN FD padding Value */
  uint8 CanFdPaddValue;
  #endif

  /* Hardware object CanIdType */
  uint8 CanTxHwObjIdType;
  /* The buffer types used by the Hardware handler */
  Can_17_McmCan_TxBufferType CanTxBufferType;
  #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON)
  /* CAN Trigger transmit status */
  boolean CanTrigTxStatus;
  #endif /* #if (CAN_17_MCMCAN_TRIG_TRANSMIT == STD_ON) */
} Can_17_McmCan_TxHwObjectConfigType;

/* CAN controller Events configuration type */
typedef struct
{
  uint8 CanEventType[CAN_17_MCMCAN_NOOF_NODES_PER_KERNEL];
} Can_17_McmCan_EventHandlingType;

#if (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)
/* Multiple periods Transmit Hw object configuration data type */
typedef struct
{
  /* Tx buffer mask value for Tx completion status check*/
  uint32 CanTxBufferMaskvalue;
  /* Hardware object Id */
  Can_HwHandleType CanPerHthHwObjId;
  /* configuration id of Controller to which this hardware object is assigned */
  uint8 HwControllerId;
} Can_17_McmCan_HthMaskObjectConfigType;

/* Multiple period Tx configuration index data type */
typedef struct
{
  /* Start Index of Hth associate with in the Period */
  Can_HwHandleType CanPerHthStartIndx;
  /* No of Hth associated with in the Period */
  Can_HwHandleType CanPerHthEndIndx;
} Can_17_McmCan_PeriodHthMaskConfigType;
#endif

#if (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_ON)
/* Multiple periods Receive Hw object configuration data type */
typedef struct
{
  /* Rx buffer mask value for receive status check (0- 31)*/
  uint32 CanPerRxbufferMaskvalue0;
  /* Rx buffer mask value for receive status check(32-63)*/
  uint32 CanPerRxbufferMaskvalue1;
  /* Hardware object Id */
  Can_HwHandleType CanPerHrhHwObjId;
  /* configuration id of Controller to which this hardware object is assigned */
  uint8 HwControllerId;
  /* The Rx buffer Type used by Hrh */
  Can_17_McmCan_RxBufferType CanPerHrhBufferType;
} Can_17_McmCan_HrhMaskObjectConfigType;

/* Multiple period Tx configuration index data type */
typedef struct
{
  /* Start Index of Hrh associate with in the Period */
  Can_HwHandleType CanPerHrhStartIndx;
  /* No of Hrh associated with in the Period */
  Can_HwHandleType CanPerHrhEndIndx;
} Can_17_McmCan_PeriodHrhMaskConfigType;

#endif

#if (CAN_17_MCMCAN_PUBLIC_ICOM_SUPPORT == STD_ON)
/* ICOM configuration data type */
typedef struct
{
  /* ICOM Message configuration start index */
  uint16 CanIcomFirstMsgIndx;
  /* No of ICOM Message configuration */
  uint16 CanIcomNoOfMsgIndx;
  /* Bus off is configured as wakeup source */
  boolean CanIcomWakeOnBusOff;
} Can_17_McmCan_IcomConfigType;

/* ICOM message configuration data type */
typedef struct
{
  /* Icom Message ID */
  Can_IdType CanIcomMsgId;
  /* Icom Message Mask value */
  Can_IdType CanIcomMaskRef;
  /* Icom Message Counter value */
  uint16 CanIcomCntrVal;
  /* Icom Message DLC value */
  uint8  CanIcomDLC;
  /* Icom Message Signal configuration Index value */
  uint8  CanIcomFirstSignalIndx;
  /* No of Message Signal configuration */
  uint8  CanIcomNoOfSignalIndx;
  /* DLC error configured as wakeup source or not */
  boolean CanIcomLengthErr;
} Can_17_McmCan_IcomRxMsgConfigType;

/*ICOM message signal configuration data type */
typedef struct
{
  /* Combination of Signal Mask value */
  uint8 CanIcomSignalMask[CAN_17_MCMCAN_ICOM_DATA_SIGNAL_MATCH_SIZE];
  /* Combination of Signal value */
  uint8 CanIcomSignalValue[CAN_17_MCMCAN_ICOM_DATA_SIGNAL_MATCH_SIZE];
  /* Operation selected for the Signal validation */
  Can_17_McmCan_IcomSignalOperType CanIcomSignalOper;
} Can_17_McmCan_IcomRxMsgSignalConfigType;

#endif

/* Data type for CAN Controller configuration */
typedef struct
{
  /* Can controller Base Node address */
  Ifx_CAN_N* CanNodeAddress;
  /* combination of Loopback and receive input pin selection setting */
  uint32 CanNPCRValue;
  /* The controller Hw object configuration mapping information with
  start address and index - Hth, SID and XID */
  uint16 CanControllerMOMap[CAN_17_MCMCAN_NOOF_MOMAP_PER_CONTROLLER];
  /* Default baudrate configuration Index */
  uint16 CanDefaultBRCfgIndx;
  /* Start index value of Baudrate configuration */
  uint16 CanBaudrateCfgIndx;
  /* Total no of Baudrate configuration */
  uint16 CanNoOfBaudrateCfg;
  /* The controller Associated Kernel configuration Index */
  uint8  CanKernelHwId;
  /* The CAN controller Hw Index */
  uint8  CanControllerHwId;
  /* The CAN controller Logical Hw Index - Controller ID defined by user */
  uint8  CanControllerLogicalId;

  #if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* FD support status of the controller */
  boolean  CanFDSupport;
  #endif

} Can_17_McmCan_ControllerConfigType;

/* Indexing with respect to Logical controoler ID */
typedef uint8 Can_17_McmCan_ControllerIndexType;

/* Indexing with multiplexed periods to transmit periods */
typedef uint8 Can_17_McmCan_HthPeriodIndexType;

/* Indexing with multiplexed periods to recieve periods */
typedef uint8 Can_17_McmCan_HrhPeriodIndexType;

/* Structure Holding the mapping details of the Configured Hth to
  core specific Hth index, Logical controller ID and the Core it is assigned to.
  The index is not considering the Hrh in the hoh objects.   */
typedef struct
{
  /* Core that the controller is assigned to */
  uint8 CanHthCoreAssigned;
  /* Logical controller indexing */
  uint8 CanHthLogicContIndex;
  /* Core specific Hth Index */
  uint16 CanHthCoreSpecIndex;
}Can_17_McmCan_HthIndexType;

/* Structure Holding the mapping details of the logical controller index to
  core specific controller index and the physical controller index */
typedef struct
{
  /* Core that the controller is assigned to */
  uint8 CanLCoreAssigned;
  /* Indexing with respect to core specific array */
  uint8 CanLCoreSpecContIndex;
  /* Node index (0-3) */
  uint8 CanLContPhyIndex;
  /* Kernel Index (0-2) */
  uint8 CanLKerPhyIndex;
}Can_17_McmCan_LogicalControllerIndexType;

/* Structure Holding the mapping details of the physical controller index to
  core specific controller index and the logical controller index */
/* Physical controllers not used shall be stubbed with the default value of
  255 */
typedef struct
{
  /* Logical controller indexing */
  uint8 CanPLogicContIndex;
  /* Indexing with respect to core specific array */
  uint8 CanPCoreSpecContIndex;
  /* Core that the controller is assigned to */
  uint8 CanPCoreAssigned;
}Can_17_McmCan_PhyControllerIndexType;

/* Type of CAN external data structure containing the overall initialization
data for the CAN Driver and SFR settings affecting all controllers assigned
per core */
typedef struct
{
  /* Number of controllers configured in the core */
  const uint8 CanCoreContCnt;
  /* Array of all the controllers configured in the core */
  const Can_17_McmCan_ControllerIndexType* CanControllerIndexingPtr;
  /* Pointer to CAN Controller configuration */
  const Can_17_McmCan_ControllerConfigType* CanControllerConfigPtr;
  /* Pointer to CAN controller corresponding Message RAM Mapping
  configuration */
  const Can_17_McmCan_ControllerMsgRAMConfigType* \
  CanControllerMsgRAMMapConfigPtr;
  /* Pointer to CAN Controller Handling of Events : Interrupt/Polling */
  const Can_17_McmCan_EventHandlingType* CanEventHandlingConfigPtr;
  /* Pointer to Controller Baudrate Configuration */
  const Can_17_McmCan_ControllerBaudrateConfigType* CanBaudrateConfigPtr;

  #if(CAN_17_MCMCAN_FD_ENABLE == STD_ON)
  /* Pointer to Controller FDBaudrate Configuration */
  const Can_17_McmCan_ControllerFDBaudrateConfigType* CanFDConfigParamPtr;
  #endif

  /* Pointer to Configuration of transmit hardware objects */
  const Can_17_McmCan_TxHwObjectConfigType* CanTxHwObjectConfigPtr;
  /* Pointer to Configuration of receive hardware objects ->Standard Messages */
  const Can_17_McmCan_SIDFilterConfigType* CanSIDFilterConfigPtr;
  /* Pointer to Configuration of receive hardware objects ->Extended Messages */
  const Can_17_McmCan_XIDFilterConfigType* CanXIDFilterConfigPtr;

  #if (CAN_17_MCMCAN_TX_MULTI_PERIODS_SUPPORT == STD_ON)
  /* Transmit Period to core specific period mapping*/
  const Can_17_McmCan_HthPeriodIndexType* CanHthPeriodIndexPtr;
  /* Pointer to Configuration of Transmit hardware objects supported with
  multiple Periods */
  const Can_17_McmCan_HthMaskObjectConfigType* CanHthMaskObjectConfigPtr;
  /* Pointer to Configuration of Tx hardware object with multiple periods */
  const Can_17_McmCan_PeriodHthMaskConfigType* CanPeriodHthMaskConfigPtr;
  #endif
  #if (CAN_17_MCMCAN_RX_MULTI_PERIODS_SUPPORT == STD_ON)
  /* Recieve Period to core specific period mapping*/
  const Can_17_McmCan_HrhPeriodIndexType* CanHrhPeriodIndexPtr;
  /* Pointer to Configuration of Receive hardware objects supported with
  multiple Periods */
  const Can_17_McmCan_HrhMaskObjectConfigType* CanHrhMaskObjectConfigPtr;
  /* Pointer to Configuration of Rx hardware object with multiple periods */
  const Can_17_McmCan_PeriodHrhMaskConfigType* CanPeriodHrhMaskConfigPtr;
  #endif

} Can_17_McmCan_CoreConfigType;

/* [cover parentID={17D20A33-9909-4557-83BF-5E15F6419166}]
   [cover parentID={1438CB3A-D1B9-4ded-80A1-C01EAA92025C}]
[/cover] */
/* Master configuration structure having the pointer index of the configurations
for all the cores in the micro-controller */
typedef struct
{
  /* Core specific configuration set */

  /* Pointer to the Core specific CAN configuration set */
  const Can_17_McmCan_CoreConfigType* CanCoreConfigPtr[MCAL_NO_OF_CORES];
  /* Global data shared amongst all cores */

  /* Number of Kernels configured */
  const uint8 CanNoOfKernel;
  /* Number of Hrh configured */
  const Can_HwHandleType CanNoOfHrh;
  /* Pointer to CAN Kernel configuration */
  const Can_17_McmCan_McmModuleConfigType* CanMCMModuleConfigPtr;
  /* Pointer holding physical controller index data */
  const Can_17_McmCan_PhyControllerIndexType* CanPhyControllerIndexPtr;
  /* Pointer holding logical controller index data */
  const Can_17_McmCan_LogicalControllerIndexType* CanLogicalControllerIndexPtr;
  /* Pointer holding configured Hth index data */
  const Can_17_McmCan_HthIndexType* CanHthIndexPtr;

